[
    {
        "message_id": 41578,
        "content": "",
        "timestamp": "2024-12-17T16:40:43",
        "sender_id": null,
        "sender_username": null,
        "media_type": true,
        "media_caption": "US Central Command releases documentation showing aerial refueling of a B-52H strategic bomber, within the command's area of ​​responsibility.\n\nTo comment, follow this link"
    },
    {
        "message_id": 41577,
        "content": "Channels identifed with the Shiite militias following the advance of IDF tanks in southern Syria:\n\nالدبابات الاسرائيلية تبعد عن الحدود العراقية الآن بحوالي 240 كيلومتر\n\nTranslation: The Israeli tanks are 240 km from the border with Iraq.\n\n##\nIt's really interesting that they use the border with Iraq as a reference point.\n\nTo comment, follow this link",
        "timestamp": "2024-12-17T16:39:17",
        "sender_id": null,
        "sender_username": null,
        "media_type": false,
        "media_caption": null
    },
    {
        "message_id": 41576,
        "content": "",
        "timestamp": "2024-12-17T15:02:05",
        "sender_id": null,
        "sender_username": null,
        "media_type": true,
        "media_caption": "Video documentation of Israeli tanks inside the village of Sidon al-Julan 👆 in Syrian territory.\n\nTo comment, follow this link"
    },
    {
        "message_id": 41574,
        "content": "",
        "timestamp": "2024-12-17T15:01:36",
        "sender_id": null,
        "sender_username": null,
        "media_type": true,
        "media_caption": "Israeli tanks inside the village of Sidon al-Julan inside Syrian territory - in southern Syria (east of the eastern ceasefire line)\n\none comment"
    },
    {
        "message_id": 41573,
        "content": "",
        "timestamp": "2024-12-17T13:18:01",
        "sender_id": null,
        "sender_username": null,
        "media_type": true,
        "media_caption": "Iranian Foreign Ministry Spokesperson:\nThe new government in Syria will bear all of Syria's financial debts to Iran.\n\n##\nGood luck collecting the debt (:\n\nMaybe it's worth sending the Iranian tax collectors to Moscow. Assad has more financial liquidity right now than the new regime in Syria...\n\nTo comment, follow this link"
    },
    {
        "message_id": 41572,
        "content": "",
        "timestamp": "2024-12-17T13:14:01",
        "sender_id": null,
        "sender_username": null,
        "media_type": true,
        "media_caption": "For the first time since 2012, the French flag is flying over the French embassy building in Damascus.\n\n##\nIt is clear that the Europeans are more enthusiastic than the rebels in the race to normalize relations with the new Syrian government.\n\nAhmad al-Sharaa/Abu Muhammad al-Julani did his job well in the blitz of interviews with Western media outlets. It seems the path is open for him. He said exactly what needed to be said.\nNow it remains to examine his actions.\n\nTo comment, follow this link"
    },
    {
        "message_id": 41571,
        "content": "",
        "timestamp": "2024-12-17T13:10:15",
        "sender_id": null,
        "sender_username": null,
        "media_type": true,
        "media_caption": "The assassination of the senior Russian officer in Moscow👆:\n\nJust yesterday, the Ukrainians accused him of using chemical weapons against Ukrainian soldiers, and this morning, he met his death.\n\nAgence France-Presse: Ukraine has accepted responsibility for the assassination of the senior Russian officer this morning in Moscow.\n\nThe Russians promise revenge.\n\nTo comment, follow this link"
    },
    {
        "message_id": 41570,
        "content": "",
        "timestamp": "2024-12-17T13:09:01",
        "sender_id": null,
        "sender_username": null,
        "media_type": true,
        "media_caption": "Ursula von der Leyen, President of the European Commission, is currently meeting with Turkish President Erdogan regarding what is happening in Syria - she knows that he is now the address for managing affairs in Syria.\n\nTo comment, follow this link"
    },
    {
        "message_id": 41566,
        "content": "",
        "timestamp": "2024-12-17T13:06:01",
        "sender_id": null,
        "sender_username": null,
        "media_type": true,
        "media_caption": "Rafah: Gazan channels are reporting the movement of displaced people from the al-Aqwad area on the coast in western Rafah towards the north following the advance of IDF maneuvering forces into the area.\n\nTo comment, follow this link"
    },
    {
        "message_id": 41565,
        "content": "",
        "timestamp": "2024-12-17T13:01:29",
        "sender_id": null,
        "sender_username": null,
        "media_type": true,
        "media_caption": "The IDF spokesman announced the death of a company commander in an engineering battalion in the Nahal Brigade in a battle in the southern Gaza Strip.\nAnother fighter, whose name has not yet been released, fell in the same incident.\n\nMay their memories be a blessing.\n\nTo comment, follow this link"
    },
    {
        "message_id": 41564,
        "content": "German newspaper \"Bild\": Germany is prepared to open an embassy in Damascus if negotiations with the rebel government are successful.\n\nTo comment, follow this link",
        "timestamp": "2024-12-17T12:57:35",
        "sender_id": null,
        "sender_username": null,
        "media_type": false,
        "media_caption": null
    },
    {
        "message_id": 41563,
        "content": "",
        "timestamp": "2024-12-17T12:57:26",
        "sender_id": null,
        "sender_username": null,
        "media_type": true,
        "media_caption": "Iranian \"Women's Day\" events:\nIran's Supreme Leader in a special meeting with \"thousands of women\" on the occasion of the birthday of Fatima, daughter of the Prophet Muhammad, which is celebrated in Iran today.\n\n#\nHe has the mannerisms of a rock star (:\n\nTo comment, follow this link"
    },
    {
        "message_id": 41559,
        "content": "",
        "timestamp": "2024-12-17T09:46:02",
        "sender_id": null,
        "sender_username": null,
        "media_type": true,
        "media_caption": "Following 👆Documentation of Turkish attacks tonight north of the city of Raqqa as well as the concentration of forces attributed to the border area with Kobani.\n\nAttached is the quote from the Wall Street Journal regarding American concerns.\n\nTo comment, follow this link"
    },
    {
        "message_id": 41558,
        "content": "Will the Turks take advantage of the conditions created between the US administrations and after the great victory of the rebels with their support?\nIf the West doesn't stop them resolutely, we can assume they will...\nAs Trump said yesterday - the Turks have been striving for this for thousands of years...\n\nTo comment, follow this link",
        "timestamp": "2024-12-17T09:45:15",
        "sender_id": null,
        "sender_username": null,
        "media_type": false,
        "media_caption": null
    },
    {
        "message_id": 41557,
        "content": "",
        "timestamp": "2024-12-17T09:45:10",
        "sender_id": null,
        "sender_username": null,
        "media_type": true,
        "media_caption": "American concerns about the Turkish army's invasion of Syrian territory in the area of ​​the Kurdish border city of Kobani\n\nThe Kurdish area in yellow is adjacent to the border with Turkey and separating two \"green islands\" controlled by the Syrian rebels.\n\nLast night, Syrian sources reported the concentration of regular Turkish army forces in the Kobani area marked with red dots on the map) as well as the opening of the border gates on the Turkish side.\n\nThe American Wall Street Journal published this morning that there are concerns that the Turks will launch a large-scale ground operation in Kobani, despite American pressure (apparently the outgoing American administration's \"Don't\" does not impress Erdogan).\n\nAccording to additional reports, last night Turkish warplanes attacked north of the city of Raqqa in the heart of the yellow area (marked with a flame).\n\n2 comments"
    },
    {
        "message_id": 41554,
        "content": "",
        "timestamp": "2024-12-17T09:34:56",
        "sender_id": null,
        "sender_username": null,
        "media_type": true,
        "media_caption": "Russia: General Igor Kirillov, commander of the Russian army's biological and radiation defense forces, was killed along with his deputy in a mysterious explosion in Moscow.\n\none comment"
    },
    {
        "message_id": 41553,
        "content": "",
        "timestamp": "2024-12-17T09:34:33",
        "sender_id": null,
        "sender_username": null,
        "media_type": true,
        "media_caption": "Gazan media outlets are reporting 10 deaths in an IDF attack last night on the home of the A-Tarq family in the Daraj neighborhood of Gaza City.\n\nTo comment, follow this link"
    },
    {
        "message_id": 41552,
        "content": "Syrian and Russian sources report that the IDF attacked several sites in Syria last night: in Homs, Latakia, and Damascus.\n\nIn Damascus, according to these sources, a target was attacked near the area of ​​al-Sida Zeinab, sacred to Shiites, in southern Damascus.\n\nSeveral headquarters of the Syrian Army's Fourth Division and the Radar Battalion in the village of Rahiba in the Damascus province were also attacked.\n\nTo comment, follow this link",
        "timestamp": "2024-12-17T09:34:06",
        "sender_id": null,
        "sender_username": null,
        "media_type": false,
        "media_caption": null
    },
    {
        "message_id": 41550,
        "content": "",
        "timestamp": "2024-12-17T09:33:36",
        "sender_id": null,
        "sender_username": null,
        "media_type": true,
        "media_caption": "Ahmed al-Sharaa also met last night with a delegation from the British Foreign Office.\n(The female British representative was without a headscarf)\n\nTo comment, follow this link"
    },
    {
        "message_id": 41546,
        "content": "",
        "timestamp": "2024-12-17T09:32:31",
        "sender_id": null,
        "sender_username": null,
        "media_type": true,
        "media_caption": "Abu Muhammad al-Julani - Trying to calm the Druze in Syria\n\nA delegation from the Druze community met tonight in Damascus with Ahmed al-Sharaa (Abu Muhammad al-Julani), leader of the rebel organization Hay'at Tahrir al-Sham.\n\nAl-Sharaa noted that Syria needs to be a unified state, with all its factions, and that the thinking need to start from a state logic and not from the logic of an (armed) opposition, as was the case during the war years.\n\nThe Druze, for their part, according to the official publication of the Syrian rebels, told al-Sharaa (what the Arabs wanted to hear:) that they would be an integral part of the Syrian state.\n\none comment"
    },
    {
        "message_id": 41545,
        "content": "",
        "timestamp": "2024-12-17T09:18:08",
        "sender_id": null,
        "sender_username": null,
        "media_type": true,
        "media_caption": "Yemen: around midnight last night Shiite channels reported an airstrike on the Yemeni Ministry of Defense building (of the Houthis) in Sanaa, the capital of Yemen.\n\nThey reported that the planes that attacked Sanaa took off from an Arab country in the Persian Gulf.\n\nShortly after the attack, the US military, in its quickest acceptance of responsibility in recent years (at least to the best of my memory), announces that it attacked a central Houthi command and control complex in the capital Sanaa.\n\nTo comment, follow this link"
    },
    {
        "message_id": 41544,
        "content": "",
        "timestamp": "2024-12-16T23:00:47",
        "sender_id": null,
        "sender_username": null,
        "media_type": true,
        "media_caption": "A drone show in Bangkok, Thailand, as part of the 2024 winter festival.\n\nTo comment, follow this link"
    },
    {
        "message_id": 41543,
        "content": "Russian news agency Sputnik: An Israeli helicopter landed today near a Syrian outpost in the suburbs of Damascus, Israeli soldiers got off the helicopter, and returned to the helicopter twenty minutes later.\n\nTo comment, follow this link",
        "timestamp": "2024-12-16T22:58:53",
        "sender_id": null,
        "sender_username": null,
        "media_type": false,
        "media_caption": null
    },
    {
        "message_id": 41542,
        "content": "",
        "timestamp": "2024-12-16T22:28:53",
        "sender_id": null,
        "sender_username": null,
        "media_type": true,
        "media_caption": "Iraq: The Khafaji brothers invite you, devout Shiites, to purchase rings and bracelets from their jewelry shop in the holy city of Karbala.\n\n100% real.\n\nOver 1.7 million views on TikTok in just a couple of days.\n\n##\nFor those of you looking for Purim costume ideas..."
    },
    {
        "message_id": 41541,
        "content": "",
        "timestamp": "2024-12-16T22:03:53",
        "sender_id": null,
        "sender_username": null,
        "media_type": true,
        "media_caption": "Syria: Ready, take aim, fire!\n\n##\nBullseye..."
    },
    {
        "message_id": 41540,
        "content": "",
        "timestamp": "2024-12-16T22:01:14",
        "sender_id": null,
        "sender_username": null,
        "media_type": true,
        "media_caption": "The US Secretary of State has officially announced that it does not rule out the possibility of reinstating its diplomatic mission in Damascus."
    },
    {
        "message_id": 41538,
        "content": "",
        "timestamp": "2024-12-16T21:59:51",
        "sender_id": null,
        "sender_username": null,
        "media_type": true,
        "media_caption": "Ahmad al-Sharaa, also known as Abu Mohammad al-Julani, leader of the rebel organization Hayat Tahrir al-Sham, in an interview with The New York Times:\n\nWe are committed to the 1974 ceasefire agreement with Israel, and the international community must also ensure Israel’s adherence to the agreement.\n\nI will not allow Syria to serve as a base for launching attacks on Israel.\n\nTo comment, follow this link"
    },
    {
        "message_id": 41537,
        "content": "IDF: Following Three Months of Combat in Southern Lebanon, the 98th Division Prepares for Combat in Gaza\n\nThe 98th Division completed their mission in the northern arena last week (Wednesday), after approximately three months of continuous combat against Hezbollah's terrorist strongholds, and conducting their defensive missions following the ceasefire agreement.\n\nThe soldiers of the 98th Division are currently preparing for their next mission in the Gaza Strip.\n\nTo comment, follow this link",
        "timestamp": "2024-12-16T20:33:56",
        "sender_id": null,
        "sender_username": null,
        "media_type": false,
        "media_caption": null
    },
    {
        "message_id": 41536,
        "content": "",
        "timestamp": "2024-12-16T20:16:54",
        "sender_id": null,
        "sender_username": null,
        "media_type": true,
        "media_caption": "The Houthi military spokesman accepts responsibility for launching a Palestine 2 hypersonic missile earlier today towards Jaffa.\n\nTo comment, follow this link"
    },
    {
        "message_id": 41534,
        "content": "",
        "timestamp": "2024-12-16T19:51:17",
        "sender_id": null,
        "sender_username": null,
        "media_type": true,
        "media_caption": "Military correspondent Doron Kadosh documents the enormous destruction in Kafrkela, a Shiite village located on the Israel-Lebanon border, opposite Metula.\n\nTo comment, follow this link"
    },
    {
        "message_id": 41533,
        "content": "",
        "timestamp": "2024-12-16T19:19:12",
        "sender_id": null,
        "sender_username": null,
        "media_type": true,
        "media_caption": "Ahmed a-Sufi, Mayor of Rafah (southern Gaza Strip):\n\nRafah has become a disaster zone that is no longer fit for human habitation.\n\nTo comment, follow this link"
    },
    {
        "message_id": 41529,
        "content": "",
        "timestamp": "2024-12-16T19:18:38",
        "sender_id": null,
        "sender_username": null,
        "media_type": true,
        "media_caption": "IDF: The 769th Brigade Located Rocket Launchers, Anti-Tank Missiles, and Mortar Shells During Defensive Activities in Southern Lebanon\n\nIDF troops in the Northern Command continue to operate to remove threats posed by Hezbollah and act against Hezbollah’s violations of the ceasefire in accordance with the understandings between Israel and Lebanon.\n\nIn the activities of the 769th Brigade, the troops located several weapon storage facilities, including a mobile rocket launcher from which numerous rockets were fired over the past year toward communities in the Galilee Panhandle, dozens of mortar shells, anti-tank missiles, rockets, explosives, mobile launchers, and additional military equipment. All findings were confiscated.\n\nTo comment, follow this link"
    }
]